---
kind: type
id: T:Autodesk.Revit.DB.Visual.AdvancedGlazing
source: html/8f4007d6-eab7-39d3-69b6-18443f9350e5.htm
---
# Autodesk.Revit.DB.Visual.AdvancedGlazing

A static class that provides access to the property names that appear in the AdvancedGlazing visual asset schema.

## Syntax (C#)
```csharp
public static class AdvancedGlazing
```